app/controllers/count_times_controller.rb

  def create
    @count_time = CountTime.create(count_time_params)
---
INSERT INTO `count_times` (`count_hour`, `user_id`, `created_at`, `updated_at`) VALUES (5, 2, '2020-01-02 08:43:16', '2020-01-02 08:43:16')