app/controllers/start_days_controller.rb

  def index
    if user_signed_in?
      @start_day = StartDay.where(user_id: current_user.id)
      @count_time = CountTime.where(user_id: current_user.id).order('updated_at DESC').limit(5)
      @count_hour = @count_time.sum(:count_hour)

      continued = CountTime.where(user_id:current_user.id)
      @Durationdays = 0

      if continued.select("id").where(created_at: 0.day.ago.all_day).blank?
          i = 1
      else
          i = 0
      end

      while continued.length do
---
SELECT `start_days`.* FROM `start_days` WHERE `start_days`.`user_id` = 2
SELECT  `count_times`.* FROM `count_times` WHERE `count_times`.`user_id` = 1 ORDER BY updated_at DESC LIMIT 5
SELECT `count_times`.* FROM `count_times` WHERE `count_times`.`user_id` = 1
SELECT  SUM(`count_times`.`count_hour`) FROM `count_times` WHERE `count_times`.`user_id` = 1 LIMIT 5
SELECT `start_days`.* FROM `start_days` WHERE `start_days`.`user_id` = 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1

  def create
    @start_day = StartDay.create(start_day_params)
---
INSERT INTO `start_days` (`start_day`, `start_time`, `user_id`, `created_at`, `updated_at`) VALUES ('2020-01-02', '2020-01-02 05:43:00', 1, '2020-01-02 05:43:24', '2020-01-02 05:43:24')