app/controllers/start_days_controller.rb

INSERT INTO `start_days` (`start_day`, `user_id`, `created_at`, `updated_at`) VALUES ('2020-01-03', 3, '2020-01-03 03:50:13', '2020-01-03 03:50:13')
---
  def create
    @start_day = StartDay.create(start_day_params)